ngo/app/controllers/country_demographics_controller.rb

SELECT "country_demographics".* FROM "country_demographics"
---
  def index
    @country_demographics = CountryDemographic.all

SELECT "country_demographics".* FROM "country_demographics" WHERE "country_demographics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_country_demographic
      @country_demographic = CountryDemographic.find(params[:id])